Revit 2020 API
CylindricalHelix Properties
The CylindricalHelix type exposes the following members.
Properties
Name | Description
ApproximateLength
The approximate length of the curve.
 (Inherited from Curve.)
BasePoint
The base point of the axis of the cylindrical helix.
GraphicsStyleId
The ElementId of the GeometryObject's GraphicsStyle
 (Inherited from GeometryObject.)
Height
 Height of the cylindrical helix.
IsBound
Describes whether the parameter of the curve is restricted to a particular interval.
 (Inherited from Curve.)
IsCyclic
The boolean value that indicates whether this curve is cyclic.
 (Inherited from Curve.)
IsElementGeometry
Indicates whether this geometry is obtained directly from an Element.
 (Inherited from GeometryObject.)
IsReadOnly
Identifies if the object is read-only or modifiable.
 (Inherited from APIObject.)
IsRightHanded
True if the helix is right handed, false if the helix is left handed.
Length
The exact length of the curve.
 (Inherited from Curve.)
Period
The period of this curve.
 (Inherited from Curve.)
Pitch
The pitch of the cylindrical helix.
Radius
The radius of the cylindrical helix.
Reference
Returns a stable reference to the curve.
 (Inherited from Curve.)
Visibility
The visibility.
 (Inherited from GeometryObject.)
XVector
The X direction vector.
YVector
The Y direction vector.
ZVector
The Z direction vector, which is same as the axis direction vector.
See Also
CylindricalHelix Class
Autodesk.Revit.DB Namespace